place_time = {
	"1" : "London, MI6 / fri 28 august, 3:50 a.m.",
	"2" : "London, дом агента Гарри / fri 28 august, 3:55 a.m.",
	"3" : "Dublin, дом агента Патрика / fri 28 august, 9:45 a.m.",
	"4" : "Dublin, дом агента Патрика / fri 28 august, 11:30 a.m.",
	"5" : "Dublin, дом агента Патрика / fri 28 august, 11:40 a.m.",
	"6" : "Dublin, дом агента Патрика / fri 28 august, 11:45 a.m.",
	"7" : "Dublin, Murphy's Pub / fri 28 august, 1:00 p.m.",
	"8" : "Dublin, Murphy's Pub / fri 28 august, 1:10 p.m.",
	"9" : "Dublin, Murphy's Pub / fri 28 august, 1:20 p.m.",
	"10" : "Dublin, Murphy's Pub / fri 28 august, 3:30 p.m.",
	"11" : "Dublin, Murphy's Pub / fri 28 august, 4:15 p.m.",
	"12" : "Килдэр, Kilkea Castle / fri 28 august, 6:30 p.m.",
	"13" : "Килдэр, Kilkea Castle / fri 28 august, 8:30 a.m.",
	"14" : "Килдэр, Kilkea Castle / fri 28 august, 8:35 a.m.",
	"15" : "Килдэр, Kilkea Castle",
	"16" : "Килдэр, Kilkea Castle",
	"17" : ""
}

text = {
	"1" : "",
	"2" : "",
	"3" : "",
	"4" : "",
	"5" : "",
	"6" : "",
	"7" : "",
	"8" : "",
	"9" : "",
	"10" : "",
	"11" : "",
	"12" : "",
	"13" : "",
	"14" : "",
	"15" : "",
	"16" : ""
}

mi6_msg = {
	"1" : "СРОЧНО: Сегодня ночью из собственного дома в Дублине был похищен агент Патрик.",
	"2" : "ДОПОЛНИТЕЛЬНО: В настоящий момент агенты Чарльз и Колин находятся на задании в Северной Америки, агент Джеймс погиб при исполнение долга год назад. Остальные агенты в данный момент не задействованы в операциях MI6. Ожидайте в ближайший час дополнительную информацию о местоположении перечисленных агентов. В ожидании дополнительной ифнормации агент Гарри решил сузить круг подозреваемых.",
	"3" : "",
	"4" : "",
	"5" : ""
}

err_text = "надо подумать ещё..."
