place_time = {
	"1" : "London, MI6 / fri 28 august, 3:50 a.m.",
	"2" : "London, agent Harry's House / fri 28 august, 3:55 a.m.",
	"3" : "Dublin, agent Patrick's House / fri 28 august, 9:45 a.m.",
	"4" : "Dublin, agent Patrick's House / fri 28 august, 11:30 a.m.",
	"5" : "Dublin, agent Patrick's House / fri 28 august, 11:40 a.m.",
	"6" : "Dublin, agent Patrick's House / fri 28 august, 11:45 a.m.",
	"7" : "Dublin, Murphy's Pub / fri 28 august, 1:00 p.m.",
	"8" : "Dublin, Murphy's Pub / fri 28 august, 1:10 p.m.",
	"9" : "Dublin, Murphy's Pub / fri 28 august, 1:20 p.m.",
	"10" : "Dublin, Murphy's Pub / fri 28 august, 3:30 p.m.",
	"11" : "Dublin, Murphy's Pub / fri 28 august, 4:15 p.m.",
	"12" : "Kildare, Kilkea Castle / fri 28 august, 6:30 p.m.",
	"13" : "Kildare, Kilkea Castle / fri 28 august, 8:30 p.m.",
	"14" : "Kildare, Kilkea Castle / fri 28 august, 8:35 p.m.",
	"15" : "Kildare, Kilkea Castle / fri 28 august, 11:55 p.m.",
	"16" : "London, MI6 / wed 3 september, 2:00 p.m."
}

text = {
	"1" : "Агент Гарри получает задание немедленно отправляться на поиски своего коллеги.",
	"2" : "Прибыв на место проишествия агент Гарри, увидел перевёрнутое вверх дном жилище своего коллеги... Проведя немало времени в поисках хоть какой-то улики, он начал отчаяваться, как вдруг заметил небольшой листок под диваном...",
	"3" : "Прошло ещё немало времени, прежде чем агент Гарри наконец-то понял, что за шифр был использован в послание на найденом листке...",
	"3_2" : "Исходный текст: ADCDEFGHIJKLMNOPQRSTUVWXYZ",
	"3_3" : "Зашифрованный : ZYXWVUTSRQPONMLKJIHGFEDCBA",
	"4" : "'Ask Murphy' что бы это значило... - подумал Гарри. Времени совсем мало, надо опросить соседей, может кто что видел. Времени хватит, что бы опросить только одного... Местные полицейкие уже всех опросили, и дали следующий список:",
	"5" : "Джинни, рассказала, что не могла спать прошлой ночью, так как старый Карл постоянно выл на луну. Она смотрела в окно, и видела около дома Патрика несколько сов, когда они пролетели на фоне полной луны... Больше она ничего рассказать не смогла, кроме воя она ничего не слышала. На вопрос знает ли она Murphy, сказала что это имя владельца паба неподаёлку.",
	"6" : "Агент Гарри заказал Guinness и спросил у владельца знает ли он Патрика. Владелец посмотрел на Гарри и спросил кодовое слово.",
	"7" : "Владелец сказал, что недавно Патрик оставил ему конверт. Гарри взял конверт, в нём был лишь небольшой диск. Гарри открыл диск на своём ноутбуке, к сожалению, он был зашифрован. Пришлось ограничется письмом в MI6, и ждать ответа...",
	"8" : "После нескольких пинт Guinness и часов ожидания, пришло сообщения от MI6. Оказалось, что часть данных, найденная на диске, связана со старым делом TOPS7897_89, в котором учавстовавало 6 агентов сов:",
	"8_2" : "В ожидании дополнительной ифнормации агент Гарри решил сузить круг подозреваемых.",
	"9" : "Спустя ещё одну пинту Guinness и час ожидания, пришло новое сообщение, c местоположением всех агентов:",
	"10" : "Теперь осталось трое. Надо выбрать из них главного подозреваемого.",
	"11" : "Всё указывает на то, что за похищением Патрика стоит агент Пирс... Надо спешить, жизнь Патрика в опасности! Пирс пойдёт на всё, что бы узнать, где диск!",
	"12" : "Агент Гарри не успел насладится красотой замка, в котором по информации MI6 находится агент Пирс, так как сразу был схвачен охраной. После выпитого сопротивлятся сил не было...",
	"13" : "Очнулся он уже в темнице, через пару часов... Он был не один, рядом с ним сидел агент Патрик. Который был рад, что коллега накоец проснулся. Он рассказал, что был похищен ночью из-за того, что Пирс не смог найти у него дома диск... Узнав, что диск сейчас в безопасности, он предложил выбираться из плена. В темнице он нашёл потойной ход, скрываемый за стеной с замком-головоломкой, которую ему пока не удалось решить...",
	"14" : "Загадку со стены, я перересовал на листок. - Сказал Патрик. - Необходимо придти от Start к Finish, собрав по пути все зелёные кружки, минуя серые клетки. Для этого в семи клетках надо правильно расположить черту:",
	"15" : "Проследовав по тунелю агенты покинули замок, выйдя в лесу неподалёку. Над ними пролетели вертолёты с агентами MI6 и их Ирландскими коллегами. Задание выполнено!",
	"16" : "Агент Пирс и его собщники были арестованы. Агенты Патрик и Чарли были награждены за храборость и отвагу в защите Соедиённого Королевства. Впереди их ждали новые дела и новые испытания на службе Её Величеству...",

}

witness = [
	{	
		"value":"1",
		"text":"Джон, люитель Guinness'a и телевизора, обычно спит прямо напротив него;"
	},
	{	"value":"2",
		"text":"Джинни, часто страдает бессоницей и любит смотреть в окно;"
	},
	{	"value":"3",
		"text":"Карл, плохо слышит и видит, но в полнолуние (было этой ночью), не спит и воет на луну;"
	},
	{	"value":"4",
		"text":"Нэнси, любит поспать, любопынта, лишь когда речь заходит о местных распродажах;"
	}
]

agents = [
		{
			"value":"1",
			"text":"Диана"
		},
		{
			"value":"2",
			"text":"Чарльз"
		},
		{
			"value":"3",
			"text":"Пирс"
		},
		{
			"value":"4",
			"text":"Шарлотта"
		},
		{
			"value":"5",
			"text":"Майкл"
		},
		{
			"value":"6",
			"text":"Колин"
		}
	]

agents2 = [
	{
		"value":"1",
		"text":"Диана"
	},
	{
		"value":"2",
		"text":"Пирс"
	},
	{
		"value":"3",
		"text":"Майкл"
	}
]

mi6_msg = {
	"1" : "СРОЧНО: Сегодня ночью из собственного дома в Дублине был похищен агент Патрик.",
	"2" : "ДОПОЛНИТЕЛЬНО: В настоящий момент агенты Чарльз и Колин находятся на задании в Северной Америки, агент Шарлотта погибла при исполнение долга год назад. Остальные агенты в данный момент не задействованы в операциях MI6. Ожидайте в ближайший час дополнительную информацию о местоположении перечисленных агентов."
}

err_text = "надо подумать ещё..."
err_text2 = "надо дать какой-то ответ..."
